user/tutorials/shockDroplet_codestream_periodic_reinitialize/0/kappa
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kappa;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 0.05; 

boundaryField
{
    wall
    {
        type            empty;
    }
        top
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.252114450681;
    }
    outlet
    {
        type            calculated;
        value           uniform 0.0530684942632;
    }
}


// ************************************************************************* //
