user/tutorials/shockDroplet_codestream_periodic_reinitialize/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField uniform 2e7;

/*
internalField   #codeStream
{
    
        codeInclude
        #{
            #include "fvCFD.H"
        #};
        codeOptions
        #{
            -I$(LIB_SRC)/finiteVolume/lnInclude \
            -I$(LIB_SRC)/meshTools/lnInclude
        #};  
        codeLibs
        #{
            -lmeshTools \
            -lfiniteVolume
        #};
        code
        #{
            const IOdictionary & d = static_cast<const IOdictionary&>(dict);
            const fvMesh& mesh = refCast<const fvMesh>(d.db());


            double plow=2e7;
            double phigh=8e7;

            scalarField p(mesh.nCells(), plow);
            forAll(p, i)
            {
                const scalar x = mesh.C()[i][0];
                //const scalar y = mesh.C()[i][1];
                //const scalar z = mesh.C()[i][2];
                if (x < 0.2)
                {
                    p[i] = phigh;
                }
            }
            p.writeEntry( "", os);
        #};
};*/


boundaryField
{
    wall
    {
        type            empty;
    }
        top
    {
        type            cyclic;
    }
    bottom
    {
        type            cyclic;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
