user/tutorials/shockDroplet_codestream_periodic_reinitialize/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("libISATVLERhoThermo.so");

application     rhoCentralRealgasFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.0003;

deltaT          1e-6;

writeControl    adjustableRunTime;

writeInterval   1e-5;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  12;//6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.1;

runTimeModifiable yes;



// ************************************************************************* //
